Шановний(а) {{$user->name}},<br><br>

Ви запросили відновлення пароля на сайті stomatwebinar.com. Будь ласка, перейдіть за посиланням нижче, щоб встановити новий пароль.<br><br>

Посилання для відновлення пароля: <a href="{{\Illuminate\Support\Facades\URL::to('/')}}/reset/{{$user->remember_token}}">Встановити новий пароль</a><br><br>

Якщо ви не запитували відновлення пароля, проігноруйте цей лист. Ваш пароль не буде змінено до тих пір, поки ви не перейдете за посиланням і не встановите новий пароль.<br><br>

У разі виникнення будь-яких питань, будь ласка, зверніться до нашої служби підтримки.<br><br>

Дякуємо, що користуєтеся нашим сервісом!<br><br>

З повагою,<br>
Команда stomatwebinar.com<br>
stomatwebinar30@gmail.com<br>
+380 99 092 64 45
